In [81]:
# 조건으로 검색하기
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [82]:
pd.DataFrame(np.random.rand(5,2), columns=['A','B'])
# 0과 1사이의 균일한 분포에서 난수를 생성
# 5행 2열의 데이터 프레임이 생성
# 각 열 이름 지정

          A         B
0  0.310390  0.079004
1  0.922864  0.519431
2  0.853929  0.676624
3  0.495044  0.081825
4  0.084562  0.832045

In [83]:
df = pd.DataFrame(np.random.rand(5,2), columns=['A','B'])

print(df['A'])
print()
print(df['A'] < 0.5)
print()

print(df[(df['A']<0.5) & (df['B'] > 0.3)])
print()
print(df.query('A < 0.5 and B >0.3'))
# query() 메서드는 복합 조건을 처리하는 데 사용됨

0    0.446025
1    0.752805
2    0.875427
3    0.957655
4    0.387528
Name: A, dtype: float64

0     True
1    False
2    False
3    False
4     True
Name: A, dtype: bool

          A         B
0  0.446025  0.730799

          A         B
0  0.446025  0.730799

In [84]:
print(df[(df['A']<0.5) & (df['B'] > 0.3)])
print()

condition = (df['A']<0.5) & (df['B'] > 0.3)
print(df[condition])
print()
print(df.query('A < 0.5 and B >0.3'))

          A         B
0  0.446025  0.730799

          A         B
0  0.446025  0.730799

          A         B
0  0.446025  0.730799

In [85]:
# 문자열 조건 검색

data = {
    'animal':['dog','cat','cat','pig','cat'],
    'name':['happy','sam','toby','mini','rocky']
    }
print(data)

# 딕셔너리 형태로 데이터를 만듦

{'animal': ['dog', 'cat', 'cat', 'pig', 'cat'], 'name': ['happy', 'sam', 'toby', 'mini', 'rocky']}

In [86]:
pd.DataFrame(data)

  animal   name
0    dog  happy
1    cat    sam
2    cat   toby
3    pig   mini
4    cat  rocky

In [87]:
df = pd.DataFrame(data)
df.head(3)

  animal   name
0    dog  happy
1    cat    sam
2    cat   toby

In [88]:
df['animal']    # animal만 series로 뽑음

0    dog
1    cat
2    cat
3    pig
4    cat
Name: animal, dtype: object

In [89]:
df['animal'].str.contains('cat')
# str.contains() 문자중에 검색하는 문자가 포함되어 있는지를 확인(T/F)

0    False
1     True
2     True
3    False
4     True
Name: animal, dtype: bool

In [90]:
# 문자의 일부로 추출된 문자도 검색 가능
df['animal'].str.contains('ca')

0    False
1     True
2     True
3    False
4     True
Name: animal, dtype: bool

In [97]:
df.animal.str.contains('ca')

0    False
1     True
2     True
3    False
4     True
Name: animal, dtype: bool

In [96]:
df['animal'].str.match('cat')

0    False
1     True
2     True
3    False
4     True
Name: animal, dtype: bool

In [93]:
df.animal.str.match('cat')

0    False
1     True
2     True
3    False
4     True
Name: animal, dtype: bool

In [94]:
# str.contaions('cat')과 str.match('cat')의 차이
# str.contaions('cat') : 지정된 패턴이 포함되어 있는 지 여부를 반환
# str.match('cat') : 지정된 패턴과 정확히 일치하는 지 여부를 반환

In [95]:
df[df['animal'].str.contains('cat')]
# cat에 해당하는 데이터 출력, condition을 사용하면 편리

# cat이라는 문자를 포함하는 행이 animal의 열에 있다면 
# 전체의 데이터 프레임에서 해당하는 열을 추출
# 이때 cat이 정확히 일치가 아니라 이 단어를 포함하는 지에 따라 달라짐

  animal   name
1    cat    sam
2    cat   toby
4    cat  rocky

In [99]:
# contain하고 match 둘다 대 소문자에 상관없이 나오게 하는 방법
# case 옵션 사용, case = False 사용 
df['animal'].str.contains('Cat', case=False)

0    False
1     True
2     True
3    False
4     True
Name: animal, dtype: bool

In [100]:
df['animal'].str.match('Cat', case = False)

0    False
1     True
2     True
3    False
4     True
Name: animal, dtype: bool

In [101]:
# 함수로 데이터 처리하기
pd.DataFrame(np.arange(5),columns=['num'])
# 0부터 4까지의 정수를 생성하고 데이터 프레임으로 만든다
# 이때 컬럼 명은 num

   num
0    0
1    1
2    2
3    3
4    4

In [102]:
# apply() : 함수를 받아서 적용함 
df = pd.DataFrame(np.arange(5),columns=['num'])

def square(x):
    return x**2

print(df)
print()
print(df['num'])

print(df['num'].apply(square))  # square이라는 함수를 적용

   num
0    0
1    1
2    2
3    3
4    4

0    0
1    1
2    2
3    3
4    4
Name: num, dtype: int32
0     0
1     1
2     4
3     9
4    16
Name: num, dtype: int64

In [103]:
df.apply(square)

   num
0    0
1    1
2    4
3    9
4   16

In [104]:
square(df)
# square 라는 사용자 정의 함수를 사용할 수도 있고,
# apply 함수를 사용하여 df.apply(square)를 사용할 수도,
# df['num'].apply(square)을 사용할 수도 있다

   num
0    0
1    1
2    4
3    9
4   16

In [105]:
# 새 열 생성>> 기존 데이터 프레임에 삽입
df['square'] = df['num'].apply(square)

print(df)

   num  square
0    0       0
1    1       1
2    2       4
3    3       9
4    4      16

In [106]:
df.num
# df['num]같음

0    0
1    1
2    2
3    3
4    4
Name: num, dtype: int32

In [107]:
df['square_lambda'] = df.num.apply(lambda x: x**2)
print(df)

   num  square  square_lambda
0    0       0              0
1    1       1              1
2    2       4              4
3    3       9              9
4    4      16             16

In [110]:
# 함수로 데이터 처리하기
df = pd.DataFrame(columns=['phone'])

df.loc[0] = '010-1234-5678'
df.loc[1] = '공일공-일이삼사-오육칠팔'
df.loc[2] = "010.1234.오육칠팔"
df.loc[3] = '공1공-1234-5육7팔'
df['preprocess_phone'] = ''

# df.loc[행, 열]

In [111]:
df

           phone preprocess_phone
0  010-1234-5678
1  공일공-일이삼사-오육칠팔
2  010.1234.오육칠팔
3  공1공-1234-5육7팔

In [115]:
def 전처리(phone):
    mapping ={
        "공":"0",
        "일":"1",
        "이":"2",
        "삼":"3",
        "사":"4",
        "오":"5",
        "육":"6",
        "칠":"7",
        "팔":"8",
        "-":"",     # -과 .을 공백으로 처리하겠다.
        ".":""
    }
    for key, value in mapping.items():
        phone = phone.replace(key,value)
    return phone

# 매핑을 딕셔너리 형태로 한 다름 items()로 뽑으면 
# df 의 행에 한글로 적힌 수를 숫자로 바꿔줌

In [116]:
df['phone']

0    010-1234-5678
1    공일공-일이삼사-오육칠팔
2    010.1234.오육칠팔
3    공1공-1234-5육7팔
Name: phone, dtype: object

In [117]:
df['phone'].apply(전처리)

0    01012345678
1    01012345678
2    01012345678
3    01012345678
Name: phone, dtype: object

In [118]:
df

           phone preprocess_phone
0  010-1234-5678
1  공일공-일이삼사-오육칠팔
2  010.1234.오육칠팔
3  공1공-1234-5육7팔

In [119]:
df['preprocess_phone'] = df['phone'].apply(전처리)
df

           phone preprocess_phone
0  010-1234-5678      01012345678
1  공일공-일이삼사-오육칠팔      01012345678
2  010.1234.오육칠팔      01012345678
3  공1공-1234-5육7팔      01012345678

In [120]:
# replace : apply 기능에서 데이터 값만 대체하고 싶을 때 사용
data = {'0':"Male", '2':'Female', '3':'Female','4':'Male'}
data

{'0': 'Male', '2': 'Female', '3': 'Female', '4': 'Male'}

In [121]:
data.values()

dict_values(['Male', 'Female', 'Female', 'Male'])

In [122]:
list(data.values())
data_list = list(data.values())

In [123]:
pd.DataFrame(data_list)

        0
0    Male
1  Female
2  Female
3    Male

In [124]:
pd.DataFrame(data_list, columns = ['Sex'])

      Sex
0    Male
1  Female
2  Female
3    Male

In [125]:
df = pd.DataFrame(data_list, columns = ['Sex'])
df.Sex.replace({'Male':0,'Female':1}) # 라벨 인코딩

0    0
1    1
2    1
3    0
Name: Sex, dtype: int64

In [126]:
df

      Sex
0    Male
1  Female
2  Female
3    Male

In [127]:
df.Sex.replace({'Male':0,'Female':1}, inplace = True)

In [128]:
df

   Sex
0    0
1    1
2    1
3    0

In [129]:
# 그룹으로 묶기
# 조건부로 집계하고 싶은 경우
df = pd.DataFrame({'key':['A','B','C','A','B','C'],
              'data': range(6)})
df.head()

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4

In [138]:
sf = pd.DataFrame({'일':['1'],
              '이': ['2'],
              '오':['5']})
sf
# 각각의 키는 컬럼 명이 된다.
# 데이터프레임을 생성할 때에는 스칼라 값이 아닌 시퀀스(리스트, 배열 등)을 사용
# 스칼라 값은 단일 값으로 정수, 부동 소수점, 문자열 등과 같은 것을 의미 
# 따라서 리스트 또는 배열로 묶으면 해결

   일  이  오
0  1  2  5

In [139]:
df.groupby('key')

In [140]:
df.groupby('key').sum()
# 키를 기준으로 data의 합

     data
key
A       3
B       5
C       7

In [141]:
df.groupby(['key','data']).sum()
# 키와 데이터를 기준으로 합인데
# df에는 키와 데이터 컬럼만을 가지므로 따로 합은 구해지지 않음

Empty DataFrame
Columns: []
Index: [(A, 0), (A, 3), (B, 1), (B, 4), (C, 2), (C, 5)]

In [142]:
# aggregate 
# groupby 통해서 집계를 함번에 계산하고자 할 때

# 데이터 생성
data = {
      'group':['A','B','A','B','A','B','A','B'],
      'data1':[20,30,40,20,30,40,30,50],
      'data2':[1,2,3,4,5,6,7,8]
      }     

pd.DataFrame(data)  
# 딕셔너리 형태로 데이터프레임 만듦
# 각각의 키는 컬럼 명으로 지정되고
# 각각의 값은 해당 열의 행으로 간다.

  group  data1  data2
0     A     20      1
1     B     30      2
2     A     40      3
3     B     20      4
4     A     30      5
5     B     40      6
6     A     30      7
7     B     50      8

In [143]:
df = pd.DataFrame(data)     
df.head()

  group  data1  data2
0     A     20      1
1     B     30      2
2     A     40      3
3     B     20      4
4     A     30      5

In [146]:
df.groupby('group').aggregate(['min', 'median', 'max'])
# group을 제외한 data1, data2 컬럼에 해당하는 열의 
# group별 각각의 컬럼의 min, median, max를 구해줌
# 리스트 형식으로 집계할 항목을 한번에 보냄

      data1            data2
        min median max   min median max
group
A        20   30.0  40     1    4.0   7
B        20   35.0  50     2    5.0   8

In [147]:
df.groupby('group').aggregate({'data1':'min', 'data2':'sum'})
# 적용하고자 하는 집계 함수가 다를 경우 딕셔너리를 사용하여 지정해줌

       data1  data2
group
A         20     16
B         20     20

In [149]:
# filter
# group by 통해 그룹으로 묶은 상태에서 그룹 속성을 기준으로 데이터를 필터링 함

def filter_mean(x):
    return x['data2'].mean() >3

# data2 열의 평균이 3보다 큰지를 판별 

print(df.groupby('group').mean())

       data1  data2
group
A       30.0    4.0
B       35.0    5.0

In [150]:
df

  group  data1  data2
0     A     20      1
1     B     30      2
2     A     40      3
3     B     20      4
4     A     30      5
5     B     40      6
6     A     30      7
7     B     50      8

In [155]:
print(df.groupby('group').filter(filter_mean))
# 각 그룹에 대해 함수를 적용하여 열의 평균이 3보다 큰 그룹만 선택
# 조건 함수를 적용하여 결과가 true를 반환하는 그룹만 필터링하여 반환
# 조건에 만족하는 그룹만 선택하여 반환

  group  data1  data2
0     A     20      1
1     B     30      2
2     A     40      3
3     B     20      4
4     A     30      5
5     B     40      6
6     A     30      7
7     B     50      8

In [156]:
print(df.groupby('group').apply(filter_mean))
# 조건 함수를 적용하여, 나온 결과인 true, false를 결합

group
A    True
B    True
dtype: bool

In [157]:
# apply 
# groupby를 통해 묶인 데이터에 함수 적용

df.groupby('group').apply(lambda x : x.max()-x.min())

       data1  data2
group
A         20      6
B         30      6

In [159]:
# get_group
# group 로 묶인 데이터에서 key 값으로 데이터 가져오기

df.groupby('group').get_group('A')
# get_group은 그룹하된 데이터에서 특정 그룹을 선택하는 데 사용
# group 열을 기준으로 그룹화한 후 A그룹을 선택하여 반환

  group  data1  data2
0     A     20      1
2     A     40      3
4     A     30      5
6     A     30      7

In [160]:
# Multi index 
# index를 계층으로 구성함

pd.DataFrame(
    np.random.randn(4,2),
    index=[['A','A','B','B'],[1,2,1,2]],
    columns=['data1','data2']
)

# np.random.randn
# >> 평균이 0이고, 표준편차가 1인 정규분포에서 난수 생성

        data1     data2
A 1  0.513930  0.482750
  2  0.301742 -0.652132
B 1 -0.423130 -1.828918
  2 -0.847344 -0.114206

In [161]:
df =\
    pd.DataFrame(
    np.random.randn(4,2),
    index=[['A','A','B','B'],[1,2,1,2]],
    columns=['data1','data2']
)
    
df['data1']

A  1    1.799904
   2    0.588372
B  1   -0.025831
   2   -1.476660
Name: data1, dtype: float64

In [162]:
# 인덱스 뿐 아니라 컬럼도 멀티로 할 수 있음
df_col = pd.DataFrame(
    np.random.randn(4,4),
    columns = [['A','A','B','B'],['1','2','1','2']]
)
df_col

          A                   B
          1         2         1         2
0 -0.816620  0.888401  0.006055 -0.131455
1 -0.751957 -0.419150  1.087588  1.195587
2 -0.580627 -1.375022 -1.335160  0.132207
3 -0.847217 -0.152608 -0.451128  0.834778

<p>
df[0] : 열이름이 0인 열을 선택<br>
df.iloc[0] : 인덱스 기반의 위치를 사용하여 선택, 첫번째 행 선택 
</p>

In [165]:
df_col['A']

          1         2
0 -0.816620  0.888401
1 -0.751957 -0.419150
2 -0.580627 -1.375022
3 -0.847217 -0.152608

In [166]:
df_col['A']['1']
# Series로 출력

0   -0.816620
1   -0.751957
2   -0.580627
3   -0.847217
Name: 1, dtype: float64

In [167]:
# pivot_table
# index: 행 index로 들어갈 key
# column: 열 index로 라벨링 되는 값
# vlaue:  분석할 데이터 값
df

        data1     data2
A 1  1.799904 -1.211792
  2  0.588372  0.206492
B 1 -0.025831 -1.975219
  2 -1.476660 -0.755847

In [168]:
data = {
    "날짜": ["2020-01-01", "2020-01-01", "2020-01-01", "2020-01-02", "2020-01-02", "2020-01-02"],
    "카테고리": ["과일", "채소", "채소", "과일", "과일", "채소"],
    "수량": [10, 15, 5, 20, 10, 5],
    '판매처':["서울","부산","제주","서울","부산","제주"]
}

In [169]:
pd.DataFrame(data)

           날짜 카테고리  수량 판매처
0  2020-01-01   과일  10  서울
1  2020-01-01   채소  15  부산
2  2020-01-01   채소   5  제주
3  2020-01-02   과일  20  서울
4  2020-01-02   과일  10  부산
5  2020-01-02   채소   5  제주

In [173]:
df = pd.DataFrame(data)

df.pivot_table(
    index='날짜',
    columns = '카테고리',
    values='수량',
    aggfunc ="sum"
)

# 각각의 인덱스와, 컬럼명, 값, 또 그 값에 무슨 집계함수를 사용할 것인지 지정
# 이때 판매처 열은 사용하지 않음

카테고리        과일  채소
날짜
2020-01-01  10  20
2020-01-02  30   5

In [174]:
df.pivot_table(
    index='날짜',
    columns = '카테고리',
    values='수량',
    aggfunc ="mean"
)

카테고리          과일    채소
날짜
2020-01-01  10.0  10.0
2020-01-02  15.0   5.0

In [175]:
df.pivot_table(
    index='날짜',
    columns = ['카테고리','판매처'],
    values='수량',
    aggfunc ="mean",
    fill_value=0
)
# values=['수량','판매처'], 안됨 판매처는 정수가 아님
# values 값에는 정수이어야 함

카테고리          과일          채소
판매처           부산    서울    부산   제주
날짜
2020-01-01   0.0  10.0  15.0  5.0
2020-01-02  10.0  20.0   0.0  5.0